/**
  ******************************************************************************
  * 文件名          : ChassisInit.c
  * 创建时间        : 2019.07.10
  * 作者            : 任云帆
  ******************************************************************************
  *								文件描述     								   *
  ******************************************************************************
  *	
	* 本文件定义了底盘所有的全局变量和初始化函数。
	*
  ******************************************************************************
  * 1.本代码基于STM32F427IIH6开发，编译环境为Keil 5。
  * 2.本代码只适用于WTRobot一代全向底盘，不建议用作其他用途
  * 3.本代码以UTF-8格式编码，请勿以ANSI编码形式打开
  * 4.本代码最终解释权归哈尔滨工业大学（深圳）南工问天战队所有
  *
  * Copyright (c) 2019 哈尔滨工业大学（深圳）南工问天战队 版权所有
  ******************************************************************************
  */
	
#include "FlyInit.h"


uint8_t UsartReceive1[4];				  				//接受上位机数据
uint8_t UsartReceive2[18];               //遥控器接收的原始数据
uint8_t CanReceiveData[8];                      //CAN接收的电机反馈信息
int Controller[2];
Fly_t Fly = {0};

void FlyInit()
{	
	Fly.Motor.KP = 15;
	Fly.Motor.KI = 1;
	Fly.Motor.KD = 1;
	Fly.Motor.outputMax = 500;
	Fly.WorkState = STOP;
}
